auerbachmi67-cloud/qizhi-cup-firmware/sdkconfig.defaults
# ESP-IDF sdkconfig.defaults — 启智杯智能小车
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# CPU 频率
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# FreeRTOS 配置
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_TICK_RATE_HZ=1000
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_OPTIMIZED_SCHEDULER=y

# 定时器
CONFIG_ESP_TIMER_PROFILING=n
CONFIG_ESP_TIMER_TASK_STACK_SIZE=3072

# ADC
CONFIG_ADC_CONTINUOUS_MODE=y
CONFIG_ADC_ONESHOT_MODE=n

# I2C
CONFIG_I2C_ISR_IRAM_SAFE=y

# MCPWM
CONFIG_MCPWM_ISR_IRAM_SAFE=y

# PCNT
CONFIG_PCNT_ISR_IRAM_SAFE=y

# WiFi
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16

# 日志
CONFIG_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# 内存
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
